ХМНПФ_Общее/DataProcessors/уп_РасчетПенсионныхВыплатОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_РасчетПенсионныхВыплатОПС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>хм_РасчетПоПрожМинимумуПенсионера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаОснЧасти</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Заявление</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СрокПП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РазмерПП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СрокСП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВариантРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РазмерСП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РазмерГП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДопЧасти</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПрожиточныйМинимум</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаМК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РазмерПенсииДляСравненения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПравоНаНакопительнуюПенсию</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НоминалОснЧасти</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НоминалДопЧасти</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_СправкаОСтаже</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ХМ_СправкаОСтраховомСтаже</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Расшифровка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаГарантированная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипСуммы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТекСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/ФИОФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ФИОФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Инициалы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_ТипыРезервовОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ТипыРезервовОПС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервПенсионныйНакоплений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервСрочнойВыплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Выплатной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервЕВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийНП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийЕВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийРасторжение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийНаследованиеРПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийНаследованиеРСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийНаследованиеРОПС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийВозвратМСКРПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийВозвратМСКРСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНаследниковРПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНаследниковРСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РезервНачисленийРазделениеСНИЛС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/DataProcessors/уп_РасчетПенсионныхВыплатОПС/Forms/Форма/Ext/Form/Module.bsl
// ХМНПФ 7.05.2018 КлименкоМИ // новый ХМ_ОбработатьСправкиОстажеСервер() // №1563
&НаСервере
Процедура ХМ_ОбработатьСправкиОстажеСервер(РазмерГП, СписокВыбора)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ХМ_СправкаОСтраховомСтаже.Ссылка КАК Справка,
	|	ХМ_СправкаОСтраховомСтаже.РазмерГосПенсии
	|ИЗ
	|	Документ.ХМ_СправкаОСтраховомСтаже КАК ХМ_СправкаОСтраховомСтаже
	|ГДЕ
	|	ХМ_СправкаОСтраховомСтаже.Заявление = &Заявление
	|УПОРЯДОЧИТЬ ПО
	|	ХМ_СправкаОСтраховомСтаже.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Заявление",Объект.Заявление);
	ТЗСправки = Запрос.Выполнить().Выгрузить();
	// +ХМНПФ 22.09.2021 ШадринАВ // ХМ_ОбработатьСправкиОстажеСервер() // №3332
	Если ТЗСправки.Количество()=1 Тогда
		Объект.ХМ_СправкаОСтаже = ТЗСправки[0].Справка;
		РазмерГП = ТЗСправки[0].РазмерГосПенсии;
	ИначеЕсли ТЗСправки.Количество()>1 Тогда
		СписокВыбора = ТЗСправки.ВыгрузитьКолонку("Справка");
	//01.07.2024 ЛыткинАМ // ХМХМ_ПечататьРасчетНаСервере //https://redmine.npf.com/issues/3891
	ИначеЕсли Объект.ДатаРасчета > '20240701' Тогда				
		РазмерГП = 0;
		Объект.ХМ_СправкаОСтаже = Неопределено;      
	Иначе
		ВызватьИсключение "Не удалось определить справку о стаже";
	КонецЕсли;	
	
	// -ХМНПФ 22.09.2021 ШадринАВ // ХМ_ОбработатьСправкиОстажеСервер() // №3332
КонецПроцедуры

&НаКлиенте
Функция ОбработатьСправкиОстаже()
	//СМОТРИ ОБЩЕЕ РАСШИРЕНИЕ
	Элементы.ХМ_СправкаОСтаже.СписокВыбора.Очистить();
	Объект.ХМ_СправкаОСтаже = Неопределено;	
	РазмерГП = 0;
	СписокВыбора = новый СписокЗначений;
	ХМ_ОбработатьСправкиОстажеСервер(РазмерГП, СписокВыбора);
	// +ХМНПФ 27.02.2020 МилевскийАЮ // ОбработатьСправкиОстаже() // №2700
	//Объект.РазмерГП = РазмерГП;
	Если Не ТипЗнч(Объект.Заявление) = Тип("ДокументСсылка.уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты") И ЗначениеЗаполнено(Объект.Заявление) Тогда 
		Если ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Заявление, "РазмерГосПенсии").РазмерГосПенсии=0 Тогда 
			Объект.РазмерГП = РазмерГП;
		КонецЕсли;
	Иначе 
		Объект.РазмерГП = РазмерГП;
	КонецЕсли;   		
	// -ХМНПФ 27.02.2020 МилевскийАЮ // ОбработатьСправкиОстаже() // №2700
	Если СписокВыбора.Количество() <> 0 Тогда 
		Элементы.ХМ_СправкаОСтаже.СписокВыбора.ЗагрузитьЗначения(СписокВыбора);
	КонецЕсли;
	ВыполнитьРасчет(Неопределено);
КонецФункции

&НаКлиенте
Процедура ХМ_ДатаРасчетаПриИзменении(Элемент)
	//СМОТРИ ОБЩЕЕ РАСШИРЕНИЕ
	ДатаРасчетаПриИзменении(Элемент);
	ОбработатьСправкиОстаже();
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПечататьРасчетНаСервере")
Функция ХМПечататьРасчетНаСервере()
	
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");

	
	ОбластьОтчет = Макет.ПолучитьОбласть("Отчет");
	Если ЗначениеЗаполнено(Объект.Заявление) Тогда
		Если ТипЗнч(Объект.Заявление) = Тип("ДокументСсылка.уп_ЗаявлениеЗЛОЕдиновременнойВыплате")  Тогда
			ОбластьОтчет.Параметры.Картинка1 = "V";
			ОбластьОтчет.Параметры.Картинка6 = "V";
		ИначеЕсли ТипЗнч(Объект.Заявление) = Тип("ДокументСсылка.уп_ЗаявлениеЗЛОНазначенииСрочнойВыплаты")  Тогда
			ОбластьОтчет.Параметры.Картинка2 = "V";
			ОбластьОтчет.Параметры.Картинка4 = "V";
		ИначеЕсли ТипЗнч(Объект.Заявление) = Тип("ДокументСсылка.уп_ЗаявлениеЗЛОНазначенииНЧТП")  Тогда
			ОбластьОтчет.Параметры.Картинка3 = "V";
			ОбластьОтчет.Параметры.Картинка5 = "V";
		КонецЕсли;
		ОбластьОтчет.Параметры.ДатаЗаявления = Объект.Заявление.Дата;
	Конецесли;

	Если ЗначениеЗаполнено(Объект.ДоговорОПС) Тогда
		ФИО = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(Объект.ДатаРасчета, Новый Структура("ФизическоеЛицо", Объект.ДоговорОПС.Участник.уп_ФизЛицо));
		ОбластьОтчет.Параметры.ФИО = ФИО.Фамилия+" "+ФИО.Имя+" "+ФИО.Отчество;
		ОбластьОтчет.Параметры.СНИЛС = Объект.ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР;
		ОбластьОтчет.Параметры.НомерДоговора = СокрЛП(Объект.ДоговорОПС.Код);
		ОбластьОтчет.Параметры.ДатаДоговора = Формат(Объект.ДоговорОПС.ДатаЗаключения,"ДФ=dd.MM.yyyy");
		ОбластьОтчет.Параметры.ДатаРождения = Формат(Объект.ДоговорОПС.Участник.уп_ФизЛицо.ДатаРождения,"ДФ=dd.MM.yyyy");
		ДатаРасчетаВозраста = ?(ЗначениеЗаполнено(Объект.ПравоНаНакопительнуюПенсию),Объект.ПравоНаНакопительнуюПенсию,?(ЗначениеЗаполнено(Объект.ДатаРасчета),Объект.ДатаРасчета,ТекущаяДата()));
		//ОбластьОтчет.Параметры.ВозрастЛет = ?(ЗначениеЗаполнено(ДоговорОПС.Участник.уп_ФизЛицо.ДатаРождения),уп_ОПС.РазобратьРазностьДат(ДатаРасчетаВозраста,ДоговорОПС.Участник.уп_ФизЛицо.ДатаРождения),"");
		ОбластьОтчет.Параметры.ВозрастНаДатуРасчета = ?(ЗначениеЗаполнено(Объект.ДоговорОПС.Участник.уп_ФизЛицо.ДатаРождения),"Возраст (лет): "+уп_ОПС.РазобратьРазностьДат(Объект.ДатаРасчета,Объект.ДоговорОПС.Участник.уп_ФизЛицо.ДатаРождения),"");
		ОбластьОтчет.Параметры.ВозрастНаДатуГосПенсии = ?(ЗначениеЗаполнено(Объект.ДоговорОПС.Участник.уп_ФизЛицо.ДатаРождения),"Возраст (лет): "+уп_ОПС.РазобратьРазностьДат(ДатаРасчетаВозраста,Объект.ДоговорОПС.Участник.уп_ФизЛицо.ДатаРождения),"");
	КонецЕсли;


	ОбластьОтчет.Параметры.ДатаРасчета = Формат(Объект.ДатаРасчета,"ДФ=dd.MM.yyyy");;
	ОбластьОтчет.Параметры.ДатаГосПенсии = Формат(Объект.ПравоНаНакопительнуюПенсию,"ДФ=dd.MM.yyyy");
	Если Объект.ВариантРасчета = 2 Тогда
		ОбластьОтчет.Параметры.СрокСП = Объект.СрокСП;
	Иначе
		ОбластьОтчет.Параметры.СрокПП = Объект.СрокПП;
	КонецЕсли;
	ОбластьОтчет.Параметры.СуммаПН = Объект.СуммаОснЧасти+Объект.СуммаДопЧасти;
	СВ = 0;
	ДСВ = 0;
	МК = 0;
	БазаПП = 0;
	БазаСП = 0;
	//Для Каждого стр из Расшифровка Цикл
	//	Если стр.ТипСуммы = Справочники.уп_ТипыСуммОПС.ВзносыФиз
	//		или стр.ТипСуммы = Справочники.уп_ТипыСуммОПС.ИДФиз Тогда
	//		СВ = СВ+стр.Сумма;
	//	ИначеЕсли стр.ТипСуммы = Справочники.уп_ТипыСуммОПС.МатКапитал
	//		или стр.ТипСуммы = Справочники.уп_ТипыСуммОПС.ИДМатКапитал Тогда
	//		МК = МК+стр.Сумма;
	//	Иначе
	//		ДСВ = ДСВ+стр.Сумма;
	//	КонецЕсли;	
	//КонецЦикла;	
	ОбластьОтчет.Параметры.СВ = Объект.СуммаОснЧасти;
	ОбластьОтчет.Параметры.ДСВ = Объект.СуммаДопЧасти-Объект.СуммаМК;
	ОбластьОтчет.Параметры.МК = Объект.СуммаМК;
	Если Объект.ВариантРасчета = 2 Тогда
		ОбластьОтчет.Параметры.СуммаПН_ПП = 0;
		ОбластьОтчет.Параметры.СуммаПН_СП = Объект.Расшифровка.Итог("Сумма");
		ОбластьОтчет.Параметры.РазмерСП = Объект.РазмерСП;
	Иначе
		ОбластьОтчет.Параметры.СуммаПН_ПП = Объект.Расшифровка.Итог("Сумма");
		ОбластьОтчет.Параметры.СуммаПН_СП = 0;
	Областьотчет.Параметры.РазмерПП = Объект.РазмерПП;

		
	ОбластьОтчет.Параметры.Процент = Объект.Процент;
	КонецЕсли; 
	
	Если Объект.ДатаРасчета<'20240701' Тогда  
		ОбластьОтчет.Параметры.ИмяОбъектаСравнения = "Размер назначенной страховой пенсии, руб.";
		ОбластьОтчет.Параметры.РазмерГП = Объект.РазмерГП;
	Иначе
		ОбластьОтчет.Параметры.ИмяОбъектаСравнения = "Прожиточный минимум, руб.";
#Вставка
		//01.07.2024 ЛыткинАМ // ХМХМ_ПечататьРасчетНаСервере //https://redmine.npf.com/issues/3891
		ОбластьОтчет.Параметры.ИмяОбъектаСравнения = "Прожиточный минимум пенсионера в целом по Российской Федерации, руб.";
#КонецВставки
		ОбластьОтчет.Параметры.РазмерГП = Объект.ПрожиточныйМинимум;
	КонецЕсли;	
	Если Объект.ПринятоеРешение>0 Тогда
		Если  Объект.ПринятоеРешение = 1 Тогда
			Областьотчет.Параметры.Картинка7 = "V";
		ИначеЕсли  Объект.ПринятоеРешение = 4 Тогда
			Областьотчет.Параметры.Картинка7 = "V";
		Иначе
			Если Объект.РазмерПП>0 Тогда
				ОбластьОтчет.Параметры.Картинка9 = "V";
			КонецЕсли;
			Если Объект.РазмерСП>0 Тогда
				ОбластьОтчет.Параметры.Картинка8 = "V";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	ТабДокумент.Вывести(ОбластьОтчет);
	#Вставка		
	// +ХМНПФ 11.12.2015 ШадринАВ // ОсновныеДействияФормыПечать() // №70
	ХМ_ПодвалОтчета(ТабДокумент);
	// -ХМНПФ 11.12.2015 ШадринАВ // ОсновныеДействияФормыПечать() // №70
	#КонецВставки
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.АвтоМасштаб = Истина;
	Возврат ТабДокумент;  
	
КонецФункции

&НаКлиенте
Процедура ХМХМ_УстановитьПрожиточныйМинимумПосле(Команда)
	ПерейтиПоНавигационнойСсылке("e1cib/list/РегистрСведений.пдс_ПрожиточныйМинимум");
КонецПроцедуры

&НаСервере
Процедура ХМПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ХМДополнитьФорму(); 
	// +ХМНПФ 10.12.2015 ШадринАВ // ПриСозданииНаСервере()
	ХМ_УстановитьДействияФормы();
	// +ХМНПФ 10.12.2015 ШадринАВ // ПриСозданииНаСервере()	
КонецПроцедуры


Процедура ХМДополнитьФорму() 
	
	уп_ДинамическиеЭлементыСервер.ХМ_СоздатьПолеВвода(ЭтаФорма,"ХМ_СправкаОСтаже",ЭтаФорма,"Объект.ХМ_СправкаОСтаже");
	
КонецПроцедуры  

// ХМНПФ 11.12.2015 ШадринАВ // Новая ХМ_ПодвалОтчета() // №70 *
&НаСервере
Процедура ХМ_ПодвалОтчета(ТабДокумент)
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ХМ_Макет");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ДолжностьФИО = ХМ_ФункцииОтчетов.ДолжностьИФИОРуководителя();
	ОбластьПодвал.Параметры.ДолжностьОтветственного = ДолжностьФИО.Должность;
	ОбластьПодвал.Параметры.ФИООтветственного = ДолжностьФИО.ФИО;
	ОбластьПодвал.Параметры.Исполнитель = ПараметрыСеанса.ТекущийПользователь;
	ТабДокумент.Вывести(ОбластьПодвал);
КонецПроцедуры

// ХМНПФ 10.12.2015 ШадринАВ // Новая ХМ_СправкаОСтажеПриИзменении() // №60
&НаКлиенте
Процедура ХМ_СправкаОСтажеПриИзменении(Элемент) 
	// +ХМНПФ 27.11.2025 КопыткоАА // http://redmine.npf.com/issues/4702
	//--Объект.РазмерГП = Объект.ХМ_СправкаОСтаже.РазмерГосПенсии;
	Если ЗначениеЗаполнено(Объект.ХМ_СправкаОСтаже) Тогда
		Объект.РазмерГП = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ХМ_СправкаОСтаже, "РазмерГосПенсии"); 
	КонецЕсли;
	// -ХМНПФ 27.11.2025 КопыткоАА // http://redmine.npf.com/issues/4702
	
	ВыполнитьРасчет(Неопределено);
КонецПроцедуры

// ХМНПФ 10.12.2015 ШадринАВ // Новая ХМ_ЗаявлениеПриИзменении() // №60
&НаКлиенте
Процедура ХМ_ЗаявлениеПриИзменении(Элемент)
	ЗаявлениеПриИзменении(Элемент);
	ОбработатьСправкиОстаже();
КонецПроцедуры

// ХМНПФ 10.12.2015 ШадринАВ // Новая ХМ_УстановитьДействияФормы()
&НаСервере
Процедура ХМ_УстановитьДействияФормы()
	// ХМНПФ 10.12.2015 ШадринАВ // ХМ_УстановитьДействияФормы() // №60
	Элементы.Заявление.УстановитьДействие("ПриИзменении", "ХМ_ЗаявлениеПриИзменении");
	Элементы.ДатаРасчета.УстановитьДействие("ПриИзменении", "ХМ_ДатаРасчетаПриИзменении");
	Элементы["ХМ_СправкаОСтаже"].УстановитьДействие("ПриИзменении", "ХМ_СправкаОСтажеПриИзменении");
КонецПроцедуры


// ХМНПФ 07.05.2018 КлименкоМИ // Новая ХМ_ОбработатьСправкиОстажеСервер() // №1563
&НаСервере
Функция ХМ_ПолучитьКонстантуДатаСледующейВыплаты()
	Возврат Константы.ХМ_ДатаСледующейВыплаты.Получить();
КонецФункции

// ХМНПФ 08.05.2018 КлименкоМИ // Новая ХМ_ПолучитьДатуЗаявления() // №1563
&НаСервере
Функция ХМ_ПолучитьДатуЗаявления()
	// +ХМНПФ 01.03.2021 ШадринАВ // ХМ_ПолучитьДатуЗаявления() // №3103
	//Возврат Объект.Заявление.ДатаРегистрации;
	Возврат Объект.Заявление.Дата;
	// -ХМНПФ 01.03.2021 ШадринАВ // ХМ_ПолучитьДатуЗаявления() // №3103
КонецФункции

// ХМНПФ 08.05.2018 КлименкоМИ // Новая ХМ_ПолучитьДатуСправкиОСтаже() // №1563
&НаСервере
Функция ХМ_ПолучитьДатуСправкиОСтаже()
	Возврат Объект.ХМ_СправкаОСтаже.Дата;
КонецФункции

Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ 10.12.2015 ШадринАВ // Новая ХМ_УстановитьДействияФормы()
	// ХМНПФ 10.12.2015 ШадринАВ // Новая ХМ_ПриОткрытии()
	// ХМНПФ 10.12.2015 ШадринАВ // ПриСозданииНаСервере()
	
	// ХМНПФ+ 10.12.2015 ШадринАВ// Новое поле ХМ_СправкаОСтаже // выбор из списка, очистка, открытие // №60
	// ХМНПФ 10.12.2015 ШадринАВ // Новая ОбработатьСправкиОстаже() // №60
	// ХМНПФ 10.12.2015 ШадринАВ // Новая ХМ_СправкаОСтажеПриИзменении() // №60
	// ХМНПФ 10.12.2015 ШадринАВ // Новая ХМ_ЗаявлениеПриИзменении() // №60
	// ХМНПФ 11.12.2015 ШадринАВ // Новая ХМ_ПодвалОтчета() // №70 * дубль в модуле обработки
	// ХМНПФ 11.12.2015 ШадринАВ // ПечататьРасчетНаСервере() // №70
	
	// ХМНПФ 14.12.2015 ЛыткинАМ // СоздатьДокумент() // №84
	// ХМНПФ 15.12.2015 ШадринАВ // СоздатьДокумент() // №90
	// ХМНПФ 15.12.2015 ШадринАВ // ХМ_ПриОткрытии() // №99
	// ХМНПФ 15.01.2016 ШадринАВ // СоздатьДокумент() // №133
	// ХМНПФ 02.03.2016 ШадринАВ // СоздатьДокумент() // №248
	// ХМНПФ 10.10.2016 ШадринАВ // СоздатьДокумент() // №569
	// ХМНПФ 17.01.2017 ШадринАВ // РасчитатьПроцент() // №753
	// ХМНПФ 07.05.2018 КлименкоМИ // Новая ХМ_ОбработатьСправкиОстажеСервер() // №1563
	// ХМНПФ 08.05.2018 КлименкоМИ // Новая ХМ_ПолучитьКонстантуДатаСледующейВыплаты() // №1563
	// ХМНПФ 08.05.2018 КлименкоМИ // СоздатьДокумент() // №1563
	// ХМНПФ 08.05.2018 КлименкоМИ // ХМ_ПриОткрытии() // №1563
	// ХМНПФ 08.05.2018 КлименкоМИ // Новая ХМ_ПолучитьДатуЗаявления() // №1563
	// ХМНПФ 08.05.2018 КлименкоМИ // Новая ХМ_ПолучитьДатуСправкиОСтаже() // №1563
	// ХМНПФ 22.02.2019 ШадринАВ // СоздатьДокумент() // №2060
	// ХМНПФ 22.02.2019 ШадринАВ // РасчитатьПроцент() // №2060
		
	// ХМНПФ 28.10.2016 ШадринАВ // ДатаРасчетаПриИзменении() // №616  // не актуально
	// ХМНПФ 28.10.2016 ШадринАВ // Новая ХМ_ДатаРасчетаПриИзмененииНаСервере() // №616  // не актуально
КонецПроцедуры

&НаКлиенте
Процедура ХМПриОткрытииПосле(Отказ)
	// ХМНПФ 10.12.2015 ШадринАВ // ХМ_ПриОткрытии() // №60
	ОбработатьСправкиОстаже();	
КонецПроцедуры

&НаКлиенте
Процедура ХМПриОткрытииПеред(Отказ)
	// ХМНПФ 15.12.2015 ШадринАВ // ХМ_ПриОткрытии() // №99
	// +ХМНПФ 08.05.2018 КлименкоМИ // ХМ_ПриОткрытии() // №1563
	//--Если ТипЗнч(ЭтаФорма.ВладелецФормы) = Тип("Форма") Тогда
	Если ТипЗнч(ЭтаФорма.ВладелецФормы)= Тип("УправляемаяФорма") Тогда
		// +ХМНПФ 27.11.2025 КопыткоАА не работает это на управляемой форме	
		// --или ТипЗнч(ЭтаФорма.ВладелецФормы) = Тип("Форма") Тогда
		// -ХМНПФ 27.11.2025 КопыткоАА не работает это на управляемой форме		
	// -ХМНПФ 08.05.2018 КлименкоМИ // ХМ_ПриОткрытии() // №1563
		ВФ = ВладелецФормы;
		ЭтаФорма.ВладелецФормы = Неопределено;
		ВФ.Закрыть();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("СоздатьДокумент")
Процедура ХМСоздатьДокумент(Команда)
	УжеЕстьРешение = ПроверитьНаличиеРешений();
	Если УжеЕстьРешение Тогда
		Возврат;
	КонецЕсли;
	#Вставка		
	// +ХМНПФ 22.02.2019 ШадринАВ // СоздатьДокумент() // №2060
	Если Объект.РазмерГП=0 Тогда
		Если Объект.ПринятоеРешение=1 ИЛИ (Объект.ПринятоеРешение=2 И НЕ Объект.ВариантРасчета=2) Тогда
			Сообщить("Внимание!!! Не заполнен 'Размер гос. пенсии'. Возможны ошибки при расчете и при вынесении решения!",СтатусСообщения.ОченьВажное);
		КонецЕсли;
	КонецЕсли;
	// -ХМНПФ 22.02.2019 ШадринАВ // СоздатьДокумент() // №2060
	#КонецВставки
	Если Объект.ПринятоеРешение = 1 Тогда
		Если ЗначениеЗаполнено(Объект.Заявление) Тогда
			РешениеКорректно();
			ПараметрыРешения = Новый Структура("Основание", Объект.Заявление);
			#Удаление 
			ОткрытьФорму("Документ.уп_РешениеОЕдиновременнойВыплате.ФормаОбъекта", ПараметрыРешения, ЭтаФорма);	
			#КонецУдаления
			#Вставка 
			// +ХМНПФ 10.10.2016 ШадринАВ // СоздатьДокумент() // №569
			ХМ_НовДок = ОткрытьФорму("Документ.уп_РешениеОЕдиновременнойВыплате.ФормаОбъекта", ПараметрыРешения);
			// -ХМНПФ 10.10.2016 ШадринАВ // СоздатьДокумент() // №569	
			#КонецВставки			
		Иначе
			ПараметрыРешения = Новый Структура();
			Основание = Новый Структура();
			Основание.Вставить("ДоговорОПС", Объект.ДоговорОПС);
			Основание.Вставить("Дата", ТекущаяДата());
			Основание.Вставить("Организация", ЗначениеРеквизитаОбъекта(Объект.ДоговорОПС,"Организация"));
			Основание.Вставить("Участник", ЗначениеРеквизитаОбъекта(Объект.ДоговорОПС,"Участник"));
			СуммаНаСчете = 0;
			МассивСтрокТаблицы = Новый Массив;
			Для Каждого стр из Объект.Расшифровка Цикл
				СтрокаМассива = Новый Структура;
				СтрокаМассива.Вставить("ДоговорОПС", Объект.ДоговорОПС);
				СтрокаМассива.Вставить("ТипРезерва", ПредопределенноеЗначение("Перечисление.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений"));
				СтрокаМассива.Вставить("ТипСуммы", стр.ТипСуммы);
				СтрокаМассива.Вставить("Сумма", стр.Сумма);
				СтрокаМассива.Вставить("СуммаГарантированная", стр.СуммаГарантированная);
				СуммаНаСчете = СуммаНаСчете+стр.Сумма;
				МассивСтрокТаблицы.Добавить(СтрокаМассива);
			КонецЦикла;	

			Основание.Вставить("Расшифровка", МассивСтрокТаблицы);
			Основание.Вставить("СуммаНаСчете", СуммаНаСчете);

			ПараметрыРешения.Вставить("Основание", Основание);
			#Удаление 
			ОткрытьФорму("Документ.уп_РешениеОЕдиновременнойВыплате.ФормаОбъекта", ПараметрыРешения, ЭтаФорма);
			#КонецУдаления
			#Вставка			
			// +ХМНПФ 10.10.2016 ШадринАВ // СоздатьДокумент() // №569
			ХМ_НовДок = ОткрытьФорму("Документ.уп_РешениеОЕдиновременнойВыплате.ФормаОбъекта", ПараметрыРешения);
			// -ХМНПФ 10.10.2016 ШадринАВ // СоздатьДокумент() // №569	
			#КонецВставки
		КонецЕсли;	
	ИначеЕсли Объект.ПринятоеРешение = 2 Тогда
		//пееревод в выплатной период
		Если Объект.ВариантРасчета = 2 Тогда
			//НовДок = Документы.уп_РешениеОНазначенииСрочнойВыплаты.СоздатьДокумент();
			//НовДок.ДокументОснование = Объект.Заявление;
			//ЗаполнитьСрочнуюВыплату(НовДок);
			ПараметрыРешения = Новый Структура();
			Основание = Новый Структура();
			Основание.Вставить("ДокументОснование", Объект.Заявление);
			ЗаполнитьСрочнуюВыплату(Основание);
			#Вставка			
			// +ХМНПФ 02.03.2016 ШадринАВ // СоздатьДокумент() // №248
			Если ЗначениеЗаполнено(Объект.Заявление) Тогда
				//Основание.НачальнаяДата = НачалоМесяца(ДобавитьМесяц(ХМ_ПолучитьДатуЗаявления(),1)); // №248
				Основание.НачальнаяДата = ХМ_ПолучитьДатуЗаявления();  // ХМНПФ 15.07.2019 ШадринАВ // СоздатьДокумент() // №2355
			КонецЕсли;
			// -ХМНПФ 02.03.2016 ШадринАВ // СоздатьДокумент() // №248
			#КонецВставки	
			ПараметрыРешения.Вставить("Основание", Основание);
			#Удаление 
			ОткрытьФорму("Документ.уп_РешениеОНазначенииСрочнойВыплаты.ФормаОбъекта", ПараметрыРешения, ЭтаФорма);
			#КонецУдаления
			#Вставка			
			// +ХМНПФ 10.10.2016 ШадринАВ // СоздатьДокумент() // №569
			ХМ_НовДок = ОткрытьФорму("Документ.уп_РешениеОНазначенииСрочнойВыплаты.ФормаОбъекта", ПараметрыРешения);
			// -ХМНПФ 10.10.2016 ШадринАВ // СоздатьДокумент() // №569	
			#КонецВставки			
		Иначе
			//НовДок = Документы.уп_РешениеОНазначенииНЧТП.СоздатьДокумент();
			//НовДок.ДокументОснование = Объект.Заявление;
			//ЗаполнитьПереводВВыплатнойПериод(НовДок);
			ПараметрыРешения = Новый Структура();
			Основание = Новый Структура();
			Основание.Вставить("ДокументОснование", Объект.Заявление);
			ЗаполнитьПереводВВыплатнойПериод(Основание);
			#Вставка			
			// +ХМНПФ 02.03.2016 ШадринАВ // СоздатьДокумент() // №248
			Если ЗначениеЗаполнено(Объект.Заявление) Тогда
				//Основание.НачальнаяДата = НачалоМесяца(ДобавитьМесяц(ХМ_ПолучитьДатуЗаявления(),1)); // №248
				Основание.НачальнаяДата = ХМ_ПолучитьДатуЗаявления();  // ХМНПФ 15.07.2019 ШадринАВ // СоздатьДокумент() // №2355
			КонецЕсли;
			// -ХМНПФ 02.03.2016 ШадринАВ // СоздатьДокумент() // №248
			#КонецВставки 	
			ПараметрыРешения.Вставить("Основание", Основание);
			#Удаление 
			ОткрытьФорму("Документ.уп_РешениеОНазначенииНЧТП.ФормаОбъекта", ПараметрыРешения, ЭтаФорма);
			#КонецУдаления
			#Вставка			
			// +ХМНПФ 10.10.2016 ШадринАВ // СоздатьДокумент() // №569
			ХМ_НовДок = ОткрытьФорму("Документ.уп_РешениеОНазначенииНЧТП.ФормаОбъекта", ПараметрыРешения);
			// -ХМНПФ 10.10.2016 ШадринАВ // СоздатьДокумент() // №569
			#КонецВставки 		
		Конецесли;
	ИначеЕсли Объект.ПринятоеРешение = 3 Тогда

		Если ЗначениеЗаполнено(Объект.Заявление) Тогда
			//НовДок.Заполнить(Объект.Заявление);
			ПараметрыРешения = Новый Структура("Основание", Объект.Заявление); 
			#Удаление 
			ОткрытьФорму("Документ.уп_РешениеОбОтказеВЕдиновременнойВыплате.ФормаОбъекта", ПараметрыРешения, ЭтаФорма);
			#КонецУдаления
			#Вставка			
			// +ХМНПФ 10.10.2016 ШадринАВ // СоздатьДокумент() // №569
			ХМ_НовДок = ОткрытьФорму("Документ.уп_РешениеОбОтказеВЕдиновременнойВыплате.ФормаОбъекта", ПараметрыРешения);
			// -ХМНПФ 10.10.2016 ШадринАВ // СоздатьДокумент() // №569
			#КонецВставки 
		Иначе
			ПараметрыРешения = Новый Структура();
			Основание = Новый Структура();
			Основание.Вставить("ДоговорОПС", Объект.ДоговорОПС);
			Основание.Вставить("Дата", ТекущаяДата());
			Основание.Вставить("Организация", ЗначениеРеквизитаОбъекта(Объект.ДоговорОПС,"Организация"));
			Основание.Вставить("Участник", ЗначениеРеквизитаОбъекта(Объект.ДоговорОПС,"Участник"));

			СуммаНаСчете = 0;
			Для каждого стр из Объект.Расшифровка Цикл
				//НовСтр = НовДок.РасшифровкаСуммы.Добавить();
				//НовСтр.ДоговорОПС = Объект.ДоговорОПС;
				//НовСтр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений;
				//НовСтр.ТипСуммы = стр.ТипСуммы;
				//НовСтр.Сумма = стр.Сумма;
				СуммаНаСчете = СуммаНаСчете+стр.Сумма;
			КонецЦикла;
			Основание.Вставить("СуммаНаСчете", СуммаНаСчете);

			ПараметрыРешения.Вставить("Основание", Основание);
			#Удаление 
			ОткрытьФорму("Документ.уп_РешениеОбОтказеВЕдиновременнойВыплате.ФормаОбъекта", ПараметрыРешения, ЭтаФорма);
			#КонецУдаления
			#Вставка			
			// +ХМНПФ 10.10.2016 ШадринАВ // СоздатьДокумент() // №569
			ХМ_НовДок = ОткрытьФорму("Документ.уп_РешениеОбОтказеВЕдиновременнойВыплате.ФормаОбъекта", ПараметрыРешения);
			// -ХМНПФ 10.10.2016 ШадринАВ // СоздатьДокумент() // №569
			#КонецВставки			
		КонецЕсли;
	ИначеЕсли Объект.ПринятоеРешение = 4 Тогда
		Если ЗначениеЗаполнено(Объект.Заявление) Тогда
			//НовДок.Заполнить(Объект.Заявление);
			ПараметрыРешения = Новый Структура("Основание", Объект.Заявление); 
			#Удаление 
			ОткрытьФорму("Документ.уп_РешениеОбОтказеНЧТП.ФормаОбъекта", ПараметрыРешения, ЭтаФорма);
			#КонецУдаления
			#Вставка			
			// +ХМНПФ 10.10.2016 ШадринАВ // СоздатьДокумент() // №569
			ХМ_НовДок = ОткрытьФорму("Документ.уп_РешениеОбОтказеНЧТП.ФормаОбъекта", ПараметрыРешения);
			// -ХМНПФ 10.10.2016 ШадринАВ // СоздатьДокумент() // №569
			#КонецВставки
		Иначе
			ПараметрыРешения = Новый Структура();
			Основание = Новый Структура();
			Основание.Вставить("ДоговорОПС", Объект.ДоговорОПС);
			Основание.Вставить("Дата", ТекущаяДата());
			Основание.Вставить("Организация", ЗначениеРеквизитаОбъекта(Объект.ДоговорОПС,"Организация"));
			Основание.Вставить("Участник", ЗначениеРеквизитаОбъекта(Объект.ДоговорОПС,"Участник"));

			СуммаНаСчете = 0;
			Для каждого стр из Объект.Расшифровка Цикл
				//НовСтр = НовДок.РасшифровкаСуммы.Добавить();
				//НовСтр.ДоговорОПС = Объект.ДоговорОПС;
				//НовСтр.ТипРезерва = Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений;
				//НовСтр.ТипСуммы = стр.ТипСуммы;
				//НовСтр.Сумма = стр.Сумма;
				СуммаНаСчете = СуммаНаСчете+стр.Сумма;
			КонецЦикла;
			Основание.Вставить("СуммаНаСчете", СуммаНаСчете);

			ПараметрыРешения.Вставить("Основание", Основание);
			#Удаление 
			ОткрытьФорму("Документ.уп_РешениеОбОтказеНЧТП.ФормаОбъекта", ПараметрыРешения, ЭтаФорма);
			#КонецУдаления
			#Вставка			
			// +ХМНПФ 10.10.2016 ШадринАВ // СоздатьДокумент() // №569
			ХМ_НовДок = ОткрытьФорму("Документ.уп_РешениеОбОтказеНЧТП.ФормаОбъекта", ПараметрыРешения);
			// -ХМНПФ 10.10.2016 ШадринАВ // СоздатьДокумент() // №569
			#КонецВставки
		КонецЕсли;
	Иначе
		Сообщить("Решение не принято.");
	КонецЕсли;	

	#Вставка			
	// +ХМНПФ 14.12.2015 ЛыткинАМ // СоздатьДокумент() // №84
	Попытка
		// +ХМНПФ 07.05.2018 КлименкоМИ // СоздатьДокумент() // №1563
		ХМ_РабочаяДата = ТекущаяДата();
		// -ХМНПФ 07.05.2018 КлименкоМИ // СоздатьДокументр() // №1563		
		Если ТипЗнч(ХМ_НовДок) = Тип("УправляемаяФорма") Тогда
			ХМ_ДокОбъект = ХМ_НовДок.Объект;
		Иначе
			ХМ_ДокОбъект = ХМ_НовДок.ЭтотОбъект;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.Заявление) Тогда
			ДатаЗаявления = ДобавитьМесяц(ХМ_ПолучитьДатуЗаявления(),1)-60*60*24;
		Иначе
			ДатаЗаявления = ХМ_РабочаяДата;
		КонецЕсли;
		Если ЗначениеЗаполнено(Объект.ХМ_СправкаОСтаже) Тогда
			ДатаСправки = ХМ_ПолучитьДатуСправкиОСтаже();
		Иначе
			ДатаСправки = ХМ_РабочаяДата;
		КонецЕсли;

		ХМ_ДокОбъект.Дата = Мин(ХМ_РабочаяДата,Макс(ДатаЗаявления,ДатаСправки));
		Если Объект.ПринятоеРешение = 1 Тогда
			ХМ_ДатаСледующейВыплаты = ХМ_ПолучитьКонстантуДатаСледующейВыплаты();
			Если ЗначениеЗаполнено(ХМ_ДатаСледующейВыплаты) И ХМ_ДатаСледующейВыплаты>ТекущаяДата() Тогда
				ХМ_ДокОбъект.ДатаВыплаты = ХМ_ДатаСледующейВыплаты;
			ИначеЕсли ХМ_РабочаяДата > ХМ_ДокОбъект.Дата Тогда
				ХМ_ДокОбъект.ДатаВыплаты = ХМ_РабочаяДата;
			Иначе
				ХМ_ДокОбъект.ДатаВыплаты = ХМ_ДокОбъект.Дата;
			КонецЕсли;
		КонецЕсли;
		// +ХМНПФ 15.01.2016 ШадринАВ // СоздатьДокумент() // №133
		ХМ_ДокОбъект.ХМ_ДатаГосПенсии = Объект.ДатаГосПенсии;
		ХМ_ДокОбъект.ХМ_РазмерГП = Объект.РазмерГП;
		Если Объект.ПринятоеРешение = 1 Тогда
			ХМ_ДокОбъект.ХМ_СрокПП = Объект.СрокПП;
		КонецЕсли;
		// -ХМНПФ 15.01.2016 ШадринАВ // СоздатьДокумент() // №133
		//ТабДокументРешения = ПечататьРасчетНаСервере();
		//ХМ_ДокОбъект.ДополнительныеСвойства.Вставить("ТабДокументРешения",ТабДокументРешения); // не работает для УФ
		// +ХМНПФ 15.12.2015 ШадринАВ // СоздатьДокумент() // №90
		ЭтаФорма.Закрыть();
		// -ХМНПФ 15.12.2015 ШадринАВ // СоздатьДокумент() // №90
	Исключение
		Если Объект.ПринятоеРешение = 1 ИЛИ Объект.ПринятоеРешение = 2 Тогда
			Сообщить("Внимание! Не удалось заполнить Решение данными расчета. Обратитесь к программисту.",СтатусСообщения.Важное);
		КонецЕсли;
	КонецПопытки;
	// -ХМНПФ 14.12.2015 ЛыткинАМ // СоздатьДокумент() // №84 
	#КонецВставки
КонецПроцедуры
